Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob/facta/skuvlahistorja3/issat-s.htm.tmx
Source language: sme
Languages: nob

source: Fertii gávvilvuođain dehe garra čorpmaiguin ceavzit.
nob: Men det var ingen bønn, alle måtte klare seg så godt de kunne.

source: Árgi gal geavai badjelgeahčahassan.
nob: Man måtte bruke kløkt eller knyttnever for å berges.

source: Gilvvuin čájálmasaide
nob: Fra kappløp til scenekunst

source: Gilvvohallan ja iešguđetlágán čájálmasat ledje guovddážis Máze skuvllas.
nob: Idrettskonkurranser og ulike sceneforestillinger sto sentralt på skolen i Máze.

source: Dálvet čuoiggaimet, čierastalaimet ja njuikkuimet sabehiiguin.
nob: Om vinteren var det langrenn og hopp, i sommerhalvåret ulike barmarksaktiviteter og fotball.

source: Bievlan ledje bievlastohkosat ja spábbačiekčan.
nob: I skoletimene øvde vi på sketsjer som vi framførte ved skoleslutt.

source: De bohte gili olbmot geahččat.
nob: Bygdefolket kom for å se forestillingene.

source: Dalle oaččuimet dálvegilvvuid vuoittuid; basttežiid ja pokálažiid jna..
nob: Under slike arrangement om våren fikk vi premier for vinterens skirenn.

source: Lei hui suohtas ávvubeaivi.
nob: Det var en fin tradisjon, en høytidelig begivenhet.

source: Muittán go ledjen vuohččan mielde gilvočuoigamis, dat lei miessemánu 17. b. 1961.
nob: Jeg husker godt det første skirennet jeg var med på, 17. mai 1961, jeg gikk i 1. klasse.

source: Lei sievlla, ja láhttu lei dušše moadde čuođi mehtera.
nob: Vi gikk uten staver, med samedrakt på og med gummistøvler på beina.

source: Maŋŋel gilvočuoigama lei boradanlanjas vuoittuid juohkin.
nob: Det var sørpeføre, og løypa var vel ikke mer enn et par hundre meter lang.

source: Gullen ahte galggan mannat beavddi lusa go skuvlahoavda čurve mu nama.
nob: Etter langrennet var det premieutdeling i spisesalen.

source: Skuvlahoavda aivve dárostii, lagadii munnje čohkuma ja jearai dárogillii maid čohkumiin galggan bargat.
nob: Jeg fikk vite av de andre barna, trolig mine søsken, at jeg måtte gå fram når navnet mitt ble ropt opp.

source: In duostan vástidit, dušše čohkulin vuovttaidan ja nahkehin čohkuma gákteohcii.
nob: Skolebestyreren snakket bare norsk og ga meg en kam i premie.

source: Olbmot boagustedje ja spežžo gieđaid.
nob: Så spurte han meg hva jeg skulle bruke den til.

source: Eahkes čájehuvvui filbma mas oinniimet Mázelaččaid ja eará báikkiid, lei somá geahččat dan filmma.
nob: Jeg torde ikke svare, bare strøk kammen raskt gjennom håret og stakk den i lomma. Alle lo og klappet i hendene.

source: Erenoamáš bures lea darvánan muitui go mis lei čájálmas mii gohčoduvvui «Byen vår», dehe «Min gávpot».
nob: Fra skoleforestillingene husker jeg spesielt godt et lite teaterstykke vi framførte som 5.-klassinger, «Byen vår.»

source: Leimmet oahpahallan ovtta vearssa guhtege, ráhkadan gárvvuid ja hámaid.
nob: Vi øvde inn et vers hver, hadde laget kostymer og scenografi.

source: Ledjen «borgermeasttir», gávpoga oaivámuš.
nob: Noen av barna var svært flinke på scenen.

source: Eará mánát ledje maiddái ráhkadan čájalmasaid.
nob: Og enkelte kunne etterlikne hva som helst, fugler og mange slags dyr.

source: Muhtumat ledje hui čeahpit lávddi alde, ja soapmásat máhtte láhttedit juohkeládje, áđđestalle lottiid ja juohkelágán meahcceelliid.
nob: En gutt fra Láhpoluoppal som gikk på framhaldsskolen, joiket på streng og selvlaget munnharpe på internatet om kvelden.

source: Sotnabeivviid mii láviimet mannat sotnabeaiskuvlii.
nob: Vi minste satt rundt ham. Om søndagene gikk vi på søndagsskole.

source: Dat lei maiddái somá, go doppe oaččuimet girjjáža masa oahpaheaddji darvvihii gollenástti juohke háve go leimmet sotnabeaiskuvllas.
nob: Det var også morsomt, for der fikk vi et lite hefte som vi kunne klebe ei gullstjerne i hver gang vi møtte opp.

source: Ja sotnabeaiskuvlla lávlagiin lei mu mielas nu čáppa nuohtta.
nob: Og jeg syntes sangene vi sang på søndagsskolen hadde fine melodier.

source: Oaivegávpogii
nob: Til hovedstaden

source: Go gearggaimet mánáidskuvllas, šattaimet nuoraidskuvlii Guovdageainnu márkanbáikái.
nob: Da vi var ferdige på barneskolen, måtte vi reise til Kautokeino for å gå på ungdomsskolen.

source: Álgománuid oruimet fulkkiid dehe oahpesolbmuid luhtte, go ođđa internáhtta ii lean vel gárvvis.
nob: De første månedene bodde vi hos slektninger i bygda fordi det nye internatbygget ikke var ferdig oppført.

source: Doppe ledje eanet leavssut ja eanet oahppofáttát.
nob: Ungdomsskolen var noe annet enn barneskolen.

source: Buot oahpahus lei dárogillii.
nob: All undervisning var på norsk.

source: Mis lei risttalaš rivgu oahpaheaddjin, ja son vikkai oahpahit min bargat oamedovddolaččat.
nob: Læreren vår var personlig kristen og prøvde å lære oss å jobbe samvittighetsfullt.

source: Mii seastigođiimet ruđa, vai beassat vuolgit guhkes mátkái maŋŋel go geargat vuođđoskuvllas.
nob: Vi begynte å spare penger til klassetur som vi skulle på etter tida på ungdomsskolen.

source: Doalaimet básáriid maidda ieža leimmet ráhkadan vuoittuid.
nob: Vi arrangerte basar med egenproduserte gevinster.

source: Doppe logaimet divttaid ja lávlluimet, vuvddiimet gáhkuid ja gáfe.
nob: Vi hadde forestillinger der vi leste dikt, sang og solgte kaker og kaffe.

source: Go gearggaimet 9. klássas 1969 giđa, vulggiimet Osloi.
nob: Da vi var ferdige med 9.-klassen forsommeren 1969, reiste vi til Oslo.

source: Oslo turistahoavda Alfhild Hovdan bođii min ovddal Fornebu girdiguolbanis.
nob: Turistsjef Alfhild Hovdan møtte oss på Fornebu flyplass.

source: Turistaásahus ja SAS mákse oasi min mátkkis.
nob: Turistforeningen og SAS betalte en del av reisen vår.

source: Eaktun dasa lei ahte mii galggaimet vázzit gávttiiguin Oslos.
nob: Betingelsen var at vi hadde på oss samedrakt under hele oppholdet.

source: Deaivvai issoras báhkka dalle doppe, 25-26 gráda.
nob: Det var svært varmt de dagene vi var der, 25–26 grader.

source: Gal dan árvida mot gávpogis lea de láđđegávttiin. Finadeimmet ollu beakkán báikkiin.
nob: Man kan jo lett tenke seg hvordan det var å gå i byen da iført samedrakt av ullklede !

source: Gaskavahku 19.06.69 beasaimet geahččat Norgga ja Ruoŧa gaskasaš spábbačiekčama, VM-kvalifiserema.
nob: Vi var innom mange kjente steder. Onsdag 19.06.69 fikk vi se VM-kvalifiseringskamp i fotball mellom Norge og Sverige.

source: Ruoŧŧa vuittii 5–2.
nob: Sverige vant 5–2, og jeg husker svenskenes Leif Eriksson som en stor målkonge.

source: Oslo-mátkkis ledje lágidan midjiide oahpásnuvvan-klássa, ja mun reivvestallen maŋŋil veahá muhtun rivgonieiddain, ohppiin gean joavku bovdii mu guossin gaskabeivviide.
nob: Arrangøren av Oslo-oppholdet vårt hadde funnet fram til en skoleklasse vi skulle bli kjent med, og jeg brevvekslet senere med en av jentene i klassen etter å ha blitt invitert hjem til dem på middag.

source: Dan mátkki maŋŋil bieđganeimmet iešguđet guvlui, eat ge leat šaddan oaidnalit šat nu dávjá.
nob: Alle fant seg slike brevvenner, men ingen fant seg visst kjæreste der. Etter klasseturen ble vi spredt for alle vinder.

source: Guovdageainnu nuoraidskuvla 9 C skuvlamátkkis Oslos 16.–23.06.1969.
nob: Kautokeino ungdomsskole 9 C på skoletur til Oslo 16.–23.06.1969.

source: Go seivo girdiin válddii Oslo turistahoavda Alfhild Hovdan sin vuostá.
nob: Da de kom med flyet blei de mottatt av Oslos turistsjef Alfhild Hovdan.

source: (Govva: NTB)
nob: (Foto: NTB)

source: Buot oahppit Arbeiderbladet guossis.
nob: Alle elevene på besøk i Arbeiderbladet.

source: Isak Aslak A. Gaup, Johan Anders Sara, Inga Susanne Gaino, Ragnhild Vars, Reidar Hirsti (Arbeiderbladet doaimmaheaddji), Alfhild Hovdan (Oslo turistahoavda) John Isak Sara, Isak Morten Hætta, Johan Mathis Turi, Issát Sámmol Heatta, Mikkel Anders M. Eira, Nils Isak Eira, Mikkel Nils Sara.
nob: Bak f.v.: Isak Aslak A. Gaup, Johan Anders Sara, Inga Susanne Gaino, Ragnhild Vars, Reidar Hirsti (Arbeiderbladet doaimmaheaddji), Alfhild Hovdan (Oslo turistahoavda) John Isak Sara, Isak Morten Hætta, Johan Mathis Turi, Isak Samuel Hætta, Mikkel Anders M. Eira, Nils Isak Eira, Mikkel Nils Sara.

source: Ellen Inga Eira (Sara), Berit Anne Oskal (Kemi), Ellen Brita Sara, Anne Kristine Skum (Steinfjell), Gunn Mari Bergan (oahpaheaddji), Johan Jernsletten (oahpaheaddji), Brita Inger Hætta (Eira), Brita Carina O. Hætta, Karen Anne Sara, Berit Anne Klemetsen.
nob: Foran f.v.: Ellen Inga Eira (Sara), Berit Anne Oskal (Kemi), Ellen Brita Sara, Anne Kristine Skum (Steinfjell), Gunn Mari Bergan (oahpaheaddji), Johan Jernsletten (oahpaheaddji), Brita Inger Hætta (Eira), Brita Carina O. Hætta, Karen Anne Sara, Berit Anne Klemetsen.

source: Nuorra sadjásaš oahpaheaddjin Mázes
nob: Ung lærervikar på Máze skole

source: Gergen joatkkaskuvllas Kárášjogas 1972 giđa.
nob: Jeg ble ferdig på gymnaset i Karasjok våren 1972.

source: In diehtán riekta maid galgen dasto bargat ja ohcen sadjásaš oahpaheaddjin Máze skuvlii.
nob: Jeg visste ikke helt sikkert hva jeg skulle gjøre, så jeg søkte på et ledig årsvikariat ved Máze skole og internat.

source: Ožžon bargun 2. luohká oahpaheaddjin sámegielas, matematihkas, risttalašvuođas ja dárogielas.
nob: Jeg ble lærer for 2. klasse i samisk, matematikk, kristendom og norsk.

source: Eanas diimmuin leimme guokte oahpaheaddji.
nob: Det meste av undervisningen foregikk etter tolærer-systemet.

source: Nubbi oahpaheaddji lei Hedmárkku nieida, gii háliidii bargat sámi skuvllas.
nob: Den andre læreren var ei jente fra Hedmark som ønsket å jobbe på en samisk skole.

source: Munnje lei buorre dorvu go son lei ollesoahppan oahpaheaddji, diđii bures mot oahpahussii galggai ráhkkanit.
nob: Det var svært nyttig for meg å ha en fagutdannet kollega som blant annet kunne hjelpe meg i planlegging og forberedelse til undervisningen.

source: Mun ges bealistan ledjen ávkin go máhtten sihke sámegiela ja dárogiela, ledjen muhtumin dego dulkan.
nob: Jeg på min side var en ressurs fordi jeg kunne både samisk og norsk, og fungerte også som en slags tolk.

source: Oahpahusas čuovuimet «sátnegovva-vuogi», das mánát ohppet sániid sátnegovvan.
nob: Både i samisk og norsk var det vanlig å klappe stavelser og uttale ordene høyt.

source: Sámegielas ledje Lásse ja Máhtte-girjjit váldogirjin.
nob: I samiskundervisningen brukte vi «Lásse ja Máhtte» - bøkene som hovedlæremidler.

source: Muđui fertii oahpaheaddji ieš ohcat čállosiid eará girjjiin, ja hárjehallanbihtáid ráhkadeimmet stensiilaárkkaide.
nob: Ellers måtte læreren finne fram til lærestoff fra andre bøker, øvelsesoppgaver laget vi som stensiler.

source: Dárogielas ledje eanet girjjit go sámegielas. Oahppat gierdevašvuođa
nob: I norskundervisningen var det flere bøker enn i samiskundervisningen.

source: Mus ledje diimmut maiddái 5., 6. ja 7. luohkás.
nob: Jeg fikk undervisningstimer også i 5.–7. klassen.

source: Go ieš ledjen áŋgir lášmmohallat ja gilvvohallat, de bijai skuvla munnje olu lášmmohallandiimmuid.
nob: Fordi jeg selv var en ivrig trimmer og idrettsutøver, fikk jeg en del kroppsøvingstimer.

source: Mánát ledje viššalat, ja muhtumat erenoamáš buorit čiekčat spáppa.
nob: Elevene var svært ivrige, og enkelte hadde virkelig talent for fotball.

source: Fuomášin ahte lei hui ávkkálaš oahpásnuvvat mánáide iešguđetlágán áiggegoluid bokte.
nob: Jeg oppdaget også at det var nyttig for lærerjobben at jeg ble kjent med elevene gjennom ulike fritidsaktiviteter.

source: Nu lei maiddái álkit gulahallat ja soabadit singuin skuvladiimmuin.
nob: Da ble det lettere å kommunisere med dem i skoletimene også.

source: Dávjá gal fertejin jearahit dain boarráset oahpaheddjiin neavvagiid, ja sii láveje veahkehit nu bures go aste ja máhtte.
nob: Ofte måtte jeg spørre om råd hos eldre kolleger, og de hjalp meg så godt de kunne og hadde anledning.

source: Muhto obbalaččat ipmirdin ahte olmmoš ferte ieš birget barggus, ii ábut earáid vuorjat nu dávjá.
nob: Men mitt inntrykk var at man måtte klare seg selv, man kunne ikke belaste de andre for mye.

source: In mun lean ge vel 20 jagi boaris go álgen oahpaheaddjin.
nob: Jeg var jo ikke mer enn knapt 20 år gammel da jeg begynte som lærer.

source: Rehálašvuohta ja vuoiggalašvuohta lei maiddái falástallama mihttomearrin.
nob: Ærlighet og rettferdighet var et av målene i kroppsøvingsundervisningen.

source: Dat ii ge lean álo nu álki.
nob: Det var ikke alltid like enkelt.

source: Muhtumiin lea dakkár luondu ahte geahččalit álo gávdnat álkis čovdosiid.
nob: Noen har som personlig egenskap å søke etter enkle løsninger.

source: Falástallamis soaitá meaddit atnit lobihis vugiid, omd. spábbačiekčamis.
nob: Og i lek og konkurranser prøver de å ty til ulovlige midler, for eksempel i fotball.

source: Lei go obage lobálaš ?
nob: Var det lovlig ?

source: Go gergen militearabálvalusas 1974 čavčča, lei Máze skuvllas fas sadjásaš virgi juovllaid rádjái.
nob: Da jeg ble ferdig med militærtjenesten høsten 1974, var det igjen et ledig vikariat ved Máze skole fram til jul.

source: Čájehuvvui ahte mus bisttii bargu Máze skuvllas gitta 1975 geassemánu rádjái.
nob: Men det viste seg etter hvert at jeg fikk jobb der helt til juni 1975.

source: Ledje juohkelágán sadjásašbarggut.
nob: Det var mange forskjellige vikarjobber.

source: Ja loahpalaččat soite dat daguhan ahte mun in álgán oahpaheaddjiskuvlii.
nob: Og til syvende og sist kan de ha ført til at jeg ikke begynte på lærerskolen.

source: Mot nu ges ?
nob: Hvordan hang det sammen ?

source: Soaittáhat daguhii ahte dán nuppi bargojagi Máze skuvllas šadden váldit dakkár bargguid maidda duohta dadjamis várra in livčče obage dohkálaš.
nob: Tilfeldigheter førte til at jeg dette andre året som lærervikar måtte ta på meg arbeidsoppdrag som jeg sant å si ikke var kvalifisert til.

source: Skuvla bijai munnje erenoamášpedagoga ja logopeda diimmuid.
nob: Skolen påla meg timene til en spesialpedagog og logoped.

source: Galgen oahpahit muhtun mánáid geain ledje erenoamáš stuora lohkan- ja čállinváttisvuođat.
nob: Jeg fikk i oppdrag å undervise elever med store lese- og skrivevansker.

source: Muhtun mánáin ledje ges hupmanváttut.
nob: Noen av elevene hadde talevansker.

source: Dan oahpahusa bijai skuvlakantuvra munnje, 22-jahkásažžii geas lei dušše joatkkaskuvla ja militearbálvalus.
nob: Denne oppgaven påla skolen meg, en 22-åring uten annet enn videregående skole og militærtjeneste.

source: Eahpidin sáhtii go dat gal obage lobálaš.
nob: Jeg tvilte på om det egentlig var lovlig.

source: Ii bat dáin mánáin leat riekti oažžut erenoamášpedagogalaš veahki ?
nob: Har ikke disse elevene rett på spesialpedagogisk hjelp ?

source: Ledjen goitge gulolaš skuvlaeiseválddiid gohččumii, ja bargen nu bures go sáhtten.
nob: Jeg var likevel lojal mot skolens pålegg og prøvde å gjøre det så godt som jeg kunne.

source: Viggen ohcat fágagirjjiin dieđuid, girjjiin main doivon dakkár bagadusaid gávdnat. In várra gávdnan nu olu dakkár dieđuid maid sáhtten atnit barggustan.
nob: Jeg lette etter informasjon i fagbøker som jeg trodde slikt fantes i. Men jeg tror ikke jeg fant så mye der som jeg kunne bruke direkte i jobben min.

source: Oahpaheaddjibargu nevttii munnje nu váttisin ahte mearridin in goassege áiggo šaddat oahpaheaddjin.
nob: Jobben min ble etter hvert så frustrerende at jeg bestemte meg for aldri å bli lærer, noe jeg senere har forstått var et feil valg i livet.

source: Dan maid dás lean čállán sáhttá ipmirdit nu ahte mu bargu 1974-75 skuvlajagi lei dušše váivi ja eahpádus.
nob: Det som jeg her har skrevet kan oppfattes som at jobben min gjennom skoleåret 1974–75 bare var elendighet og rådløshet.

source: Nu ii heađisge lean.
nob: Slik var det slettes ikke.

source: Mus ledje maiddái dán háve ollu lášmmohallandiimmut ja eará fágat.
nob: Jeg hadde denne gang også mange timer kroppsøving og andre fag.

source: Golbma mánu bargen maiddái ovdaskuvlaoahpaheaddjin.
nob: I tre måneder jobbet jeg også som førskolelærer.

source: Dat lei duođai miellagiddevaš.
nob: Det var virkelig interessant.

source: Fuomášin oalle fargga ahte 5-6-jahkásaččaiguin fertejin gulahallat eará láhkái go 8.-9. klássain.
nob: Jeg oppdaget fort at jeg måtte kommunisere annerledes med 5–6-åringer enn med 8.–9.-klassinger !

source: Mii stoagaimet dieđusge ollu.
nob: Vi lekte selvsagt mye.

source: Diehttelasat stoagaimet ollu olgun muohttagis.
nob: Vi smurte med alle slags farger på store ark.

source: Muhtumin moattis sis ledje čiehkádan muohtaskálvái, ledje goivon dasa ráiggi.
nob: Vi laget rare figurer av formkitt, skrev egne eventyr og klatret opp på skap og hyller.

source: Dahke measta heađi go in álggos gávdnan sin.
nob: Og selvfølgelig lekte vi mye ute i snøen.

source: Máze skuvlla 2. luohkká 1972/73. Gurut bealde: Karen Inga Kristiansen, Marianne N. Sara, Jostein Hætta, Isak Johnsen Eira, Inger Marie N. Eira (Gaup), Klemet Anders N. Bueng, Marit Trosviken (oahpaheaddji), Kirsten Anne Logje, Jørgen M. Kemi, Per Anton Utsi, Siv Mathisen, Per Mathis M. Gaup.
nob: 2. klasse ved Masi skole 1972/73. fra venstre: Karen Inga Kristiansen, Marianne N. Sara, Jostein Hætta, Isak Johnsen Eira, Inger Marie N. Eira (Gaup), Klemet Anders N. Bueng, Marit Trosviken (oahpaheaddji), Kirsten Anne Logje, Jørgen M. Kemi, Per Anton Utsi, Siv Mathisen, Per Mathis M. Gaup.

source: (Govva: Issát Sámmol Heatta)
nob: (Foto: Issát Sámmol Heatta)

source: Eat jeagadan juoigangildosa
nob: Ville ikke følge joikeforbudet

source: Ovdaskuvllas lei olu lávlun ja musihkka.
nob: I førskolen var det mye sang og musikk.

source: Mun orron dalle Máze guosseviesus.
nob: Jeg leide hybel på Máze gjestegård.

source: Dálu vuolitgearddis dat ledje ge ovdaskuvladiimmut.
nob: Førskolen holdt til i kjelleretasjen.

source: Musihkkabottuin láviimet muhtumin mannat mu latnjii.
nob: I musikktimene brukte vi noen ganger rommet mitt.

source: Ledjen viežžan skuvllas skilanasaid ja dearppanasaid.
nob: Jeg hadde hentet forskjellige rytmeinstrumenter fra skolen.

source: Mus lei alddán gitára.
nob: Selv hadde jeg gitar.

source: Mánát háliidedje lávlut oahpes lávlagiid.
nob: Barna ville synge de kjente sangene først.

source: Mii lávlluimet daid maid sii háliidedje. De muhtun sis juoiggastii Áillohačča dahkan luođi.
nob: Plutselig satte en av barna i gang med en joik som den berømte Áillohaš hadde komponert.

source: Dalle ii lean lohpi juoigat Guovdageainnu suohkana skuvllain.
nob: På den tiden hadde skolestyret forbudt joik på skolene i Kautokeino kommune.

source: Jurdilin ahte ii sáhte leat boastut oahpahit mánáide min árbevirolaš musihka.
nob: Men jeg tenkte at det umulig kunne være galt å undervise i vår tradisjonelle musikkform.

source: Bidjen jiena el-gitárii ja rohttehin luođi mánáiguin.
nob: Jeg slo på elgitaren og stemte i med joikemelodier sammen med barna.

source: Mus lei jietnabáddi ja válden dasa go mii lávlluimet ja juoiggaimet.
nob: Jeg hadde båndopptaker og gjorde opptak mens vi joiket og sang.

source: Ja nu juoiggadin ja čuojahin Máze ovdaskuvlamánáiguin 1975 giđđadálvvi, vaikko dihten ahte lei skuvlastivrra mearrádusa vuostá.
nob: Og slik joiket jeg sammen med førskolebarna i Máze våren 1975, selv om jeg visste at det stred mot skolestyrets vedtak.

source: Jurddašin gal: Mot son dál geavvá muinna go mánát muitalit ruovttus ahte sii leat leamaš mu lanjas juoigame ?
nob: Jeg lurte etterpå hvordan foreldrene ville reagere når barna fortalte at de hadde vært på rommet mitt og joiket !

source: Ii oktage váhnen jietnadan maidege muinna.
nob: Ingen av foreldrene sa noenting til det.

source: Sii soite suollemasat mielas dasa go oahpaheimmet sin mánáide luohtešuoŋaid.
nob: Jeg tror de i sitt stille sinn likte at barna fikk lære joikemelodier.

source: Máze skuvllas lei Per K. Løberg álggahan lávlun- ja juoiganjoavkku, Máze Nieiddat.
nob: På Máze skole hadde musikklærer Per K. Løberg startet en sang- og joikegruppe, Máze Nieiddat.

source: Nu lei juoigan juo buori muddui dohkkehuvvon Máze skuvlabirrasis.
nob: Og på den måten var bruk av joik i skolesammenheng på god vei akseptert.

source: Dál badjel 30 jagi maŋŋil anán rápmin go eat lean gulolaččat buot dasa maid Guovdageainnu skuvlastivra lei mearridan.
nob: Nå, over 30 år senere, er jeg stolt over at vi ikke var så lydige mot alt det som skolestyret i Kautokeino hadde vedtatt.

source: Olu rievdan olbmo eallinagis
nob: Store endringer på en mannsalder

source: Badjel 30 jagi maŋŋel go ledjen sadjásaš oahpaheaddjin Máze skuvllas 1972-73 ja 1974-75, bargen moadde vahkku sadjásaš oahpaheaddjin 2007/2008 skuvlajagi álggus.
nob: Over 30 år etter at jeg jobbet som vikarlærer ved Máze skole 1972/73 og 1974/75, kom jeg i begynnelsen av skoleåret 2007/08 tilbake til Máze skole og jobbet noen uker som vikarlærer.

source: Áiggun dás bálddastahttit dan guokte áigodaga go lean bargan Máze skuvllas, dađi mielde go olmmoš muitá nie guhkes áigodaga.
nob: Jeg vil her sammenligne de periodene jeg har jobbet der, så langt den menneskelig hukommelse rekker.

source: Oahpaheaddji doaibma rievdan
nob: Lærerens rolle er endret

source: Dalle go bargen vuosttaš áigodaga ledjen dušše 5-6 jagi boarráset go skuvlla boarráseamos oahppit. Dál lean juo muhtun mánáid ádjáid ja áhkuid agis.
nob: De som har jobbet på en skole, enten som lærer eller med andre gjøremål, vet godt hvordan det er på nåværende skoler, på godt og vondt.

source: Formálalaččat lea oahpaheaddji rolla rievdan olu dan 35 jagis.
nob: Formelt sett er lærerens rolle endret mye på 35 år.

source: Ovddeš távvaloahpahus lea unnon, oahppit barget dál eanet ieža.
nob: Læreren skal veilede og motivere dem, og selvsagt støtte dem faglig.

source: Oahpaheaddji galgá neavvut ja movttiidahttit sin, ja dieđusge veahkehit fágalaččat.
nob: Elevgruppen (klassen) er viktig i den sammenhengen, men også elevenes særpreg og individuelle behov.

source: Ohppiid joavkku (klássa) ovttasdoaibman lea das dehálaš, muhto maiddái juohke oahppi iešvuohta ja sierra dárbbut.
nob: Fordi folketallet har gått ned, er det færre elever på skolen.

source: Go olmmošlohku lea unnon, eai leat šat nu olu oahppit skuvllas.
nob: Derfor må lærerne ha opplæring for flere årstrinn samtidig i samme klasserom.

source: Danne fertejit oahpaheaddjit oahpahit máŋga jahkeceahki ohppiid oktanaga ja ovtta lanjas.
nob: Skolen er delt i småtrinnet (1.–4.), mellomtrinnet (5.–7.) og ungdomsskolen (8.–10.).

source: Skuvlla ulbmilat rievdan
nob: Skolens målsetting endret

source: Skuvlla ulbmilat leat rievddadan vássán áigodagas, ja oahpahusa ovddasvástádus lea dál formálalaččat juohkásan maiddái váhnemiidda.
nob: Skolens målsetting har endret seg gjennom tidene, og ansvaret for opplæringen er nå formelt også lagt på foreldrene.

source: Skuvla ja váhnemat galget veahkkálága lágidit máná oahppama ja ovdáneami.
nob: Skolen og foreldrene skal i fellesskap ta seg av barnets opplæring og utvikling.

source: Oahppit ožžot juohke vahkkui plána, ja dan plána galgá oahpaheaddji ráhkadit.
nob: Dette krever god planlegging fra læreren og skolen, og presis informasjon.

source: Oahpaheaddjis lea ollu diehtojuohkinbargu, ja son galgá maiddái čuovvut bures mielde oahpahanvugiid ođasteamis.
nob: Elevene får plan for hver uke, og planen skal læreren lage. Læreren har mye informasjonsarbeid, og han / hun må stadig oppdatere seg faglig.

source: Máŋgga dáfus sáhttá dadjat dálá oahpaheddjiin losit barggu go ovddeš oahpaheddjiin.
nob: På mange måter kan man si at dagens lærere har et tyngre arbeid enn lærerne før i tiden.

source: Oahpaheddjiin, ja muđui ollesolbmuin, ii leat dat vuoigatvuohta mánáid guovdu mii ovddeš áiggiid lei.
nob: Undersøkelser har vist at elevene i norske skoler er svært urolige, og intet tyder på at det er noe bedre i samiske skoler, heller tvert om.

source: Dál ii leat lohpi ráŋgut dehe gieđahallat mánáid garrasit.
nob: Lærere og øvrige voksne har ikke den samme autoritet som før.

source: Oahpaheaddji galgá máhttit eará vugiiguin hálddašit ohppiidjoavkku.
nob: I dag er det ulovlig med fysisk straff eller hardhendt behandling av barn.
